Revit 2027 API
RebarBendingDetailType.OrthogonalAndOverallDimesionsEnabled Property
 Identifies if orthogonal and overall dimensions are displayed.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool OrthogonalAndOverallDimesionsEnabled { get; set; }
Public Property OrthogonalAndOverallDimesionsEnabled As Boolean
	Get
	Set
public:
property bool OrthogonalAndOverallDimesionsEnabled {
	bool get ();
	void set (bool value);
}
member OrthogonalAndOverallDimesionsEnabled : bool with get, set
Property Value
Boolean
Remarks
 Orthogonal segment length dimensions are dimensions defining the slope of a bar segment. Overall dimensions are dimensions that spans over multiple segments.
See Also
Reference
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace